tests/xml/200_epayment_cancelled.xml

<?xml version="1.0"?>
<APIResponse version="20160719">
    <Header>
        <Date>2017-02-06T11:43:10+01:00</Date>
        <Path>API/ePaymentVerify</Path>
        <ErrorCode>0</ErrorCode>
        <ErrorMessage/>
    </Header>
    <Body>
        <Result>Cancelled</Result>
        <Transactions>
            <Transaction>
                <TransactionId>1034</TransactionId>
                <PaymentId>f66c19ca-1268-497f-9578-c1cd4919c365</PaymentId>
                <AuthType>paymentAndCapture</AuthType>
                <CardStatus>NoCreditCard</CardStatus>
                <CreditCardToken/>
                <CreditCardMaskedPan/>
                <ThreeDSecureResult>Not_Applicable</ThreeDSecureResult>
                <LiableForChargeback>Merchant</LiableForChargeback>
                <CVVCheckResult>Not_Applicable</CVVCheckResult>
                <BlacklistToken/>
                <ShopOrderId>145000154</ShopOrderId>
                <Shop>AltaPay Functional Test Shop</Shop>
                <Terminal>AltaPay Test EPayment Terminal</Terminal>
                <TransactionStatus>epayment_cancelled</TransactionStatus>
                <ReasonCode>NONE</ReasonCode>
                <MerchantCurrency>840</MerchantCurrency>
                <MerchantCurrencyAlpha>USD</MerchantCurrencyAlpha>
                <CardHolderCurrency>840</CardHolderCurrency>
                <CardHolderCurrencyAlpha>USD</CardHolderCurrencyAlpha>
                <ReservedAmount>0.00</ReservedAmount>
                <CapturedAmount>0.00</CapturedAmount>
                <RefundedAmount>0.00</RefundedAmount>
                <CreditedAmount>0.00</CreditedAmount>
                <RecurringDefaultAmount>0.00</RecurringDefaultAmount>
                <SurchargeAmount>0.00</SurchargeAmount>
                <CreatedDate>2017-02-06 11:42:52</CreatedDate>
                <UpdatedDate>2017-02-06 11:43:10</UpdatedDate>
                <PaymentNature>EPayment</PaymentNature>
                <PaymentSchemeName>TestEPayment</PaymentSchemeName>
                <PaymentNatureService name="TestAcquirerEPayment">
                    <SupportsRefunds>true</SupportsRefunds>
                    <SupportsRelease>false</SupportsRelease>
                    <SupportsMultipleCaptures>false</SupportsMultipleCaptures>
                    <SupportsMultipleRefunds>true</SupportsMultipleRefunds>
                </PaymentNatureService>
                <ChargebackEvents/>
                <PaymentInfos>
                    <PaymentInfo name="qoute">
                        <![CDATA[835]]>
                    </PaymentInfo>
                </PaymentInfos>
                <CustomerInfo>
                    <UserAgent>Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/55.0.2883.87 Chrome/55.0.2883.87 Safari/537.36</UserAgent>
                    <IpAddress>127.0.0.1</IpAddress>
                    <Email>
                        <![CDATA[x@c.com]]>
                    </Email>
                    <Username/>
                    <CustomerPhone>x</CustomerPhone>
                    <OrganisationNumber/>
                    <CountryOfOrigin>
                        <Country>US</Country>
                        <Source>BillingAddress</Source>
                    </CountryOfOrigin>
                    <BillingAddress>
                        <Firstname>
                            <![CDATA[x]]>
                        </Firstname>
                        <Lastname>
                            <![CDATA[x]]>
                        </Lastname>
                        <Address>
                            <![CDATA[x
                            x]]>
                        </Address>
                        <City>
                            <![CDATA[x]]>
                        </City>
                        <Region>
                            <![CDATA[Alabama]]>
                        </Region>
                        <Country>
                            <![CDATA[US]]>
                        </Country>
                        <PostalCode>
                            <![CDATA[x]]>
                        </PostalCode>
                    </BillingAddress>
                    <ShippingAddress>
                        <Firstname>
                            <![CDATA[x]]>
                        </Firstname>
                        <Lastname>
                            <![CDATA[x]]>
                        </Lastname>
                        <Address>
                            <![CDATA[x
                            x]]>
                        </Address>
                        <City>
                            <![CDATA[x]]>
                        </City>
                        <Region>
                            <![CDATA[Alabama]]>
                        </Region>
                        <Country>
                            <![CDATA[US]]>
                        </Country>
                        <PostalCode>
                            <![CDATA[x]]>
                        </PostalCode>
                    </ShippingAddress>
                </CustomerInfo>
                <ReconciliationIdentifiers/>
            </Transaction>
        </Transactions>
    </Body>
</APIResponse>